### Dict를 통한 데이터 프레임 생성

In [1]:
import pandas as pd

In [2]:
dummy = {'a': [1, 2, 3], 'b' : [4, 5, 6]}
df = pd.DataFrame(dummy)

In [3]:
df

   a  b
0  1  4
1  2  5
2  3  6

In [4]:
a = [[1, 4, 7], [2, 5, 8], [3, 6, 9]]
df2 = pd.DataFrame(a)
print(df2)

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [6]:
a = {'company' : ['abc', '회사', 123], '위치' : ['Seoul', np.NaN  ,' Busan']}

In [5]:
import numpy as np

In [8]:
df3 = pd.DataFrame(a)
df3

  company      위치
0     abc   Seoul
1      회사     NaN
2     123   Busan

In [9]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6]})

In [10]:
df.columns

Index(['a', 'b'], dtype='object')

In [11]:
df.columns = ['d', 'e']

In [12]:
df

   d  e
0  1  4
1  2  5
2  3  6

In [13]:
df.rename(columns= {'d': '디'})
# 이 코드만으로는 저장이 안됨 , inplace=True로 저장

   디  e
0  1  4
1  2  5
2  3  6

In [14]:
df

   d  e
0  1  4
1  2  5
2  3  6

In [16]:
import copy
df2 = copy.deepcopy(df)

In [17]:
df.columns = ['e', 'f']

In [19]:
print(df)
print(df2)

   e  f
0  1  4
1  2  5
2  3  6
   d  e
0  1  4
1  2  5
2  3  6

### 시리즈

In [21]:
type(df['e'])

pandas.core.series.Series

In [22]:
a = pd.Series([1, 2, 3, 4, 5, 6])

In [23]:
a

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [33]:
a = pd.Series([1, 2, 3], index = ['a', 'b', 'c'])
# 시리즈를 만들기 위해서는 하나씩 만들어줘야 한다.

In [25]:
a

a    1
b    2
c    3
dtype: int64

In [26]:
df = pd.DataFrame({'a': [1, 2, 3, 4, 5, 6], 'b': [4, 5, 6, 7, 8, 9], 'c' : [1, 2, 3, 1, 2, 3]})

In [30]:
a = df['c']

In [34]:
a.unique()

array([1, 2, 3], dtype=int64)

In [35]:
df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)]})
# index값을 지정하면 좌측 행 이름을 바꿀 수 있음

In [36]:
df

    a   b
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [37]:
df[['a','b']]

    a   b
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [38]:
df.loc(0)

In [39]:
df.loc[0]

a     1
b    11
Name: 0, dtype: int64

In [40]:
df.loc[2:4]

   a   b
2  3  13
3  4  14
4  5  15

In [43]:
df.iloc[:5, :]

   a   b
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [45]:
df[df['a'] >=3]['a']

2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: a, dtype: int64

In [47]:
df.sort_index() # 인덱스 기준 정렬

    a   b
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [52]:
df.sort_index(ascending=False, inplace=True) # 값을 저장하고 싶으면 inplace=True

In [53]:
df

    a   b
9  10  20
8   9  19
7   8  18
6   7  17
5   6  16
4   5  15
3   4  14
2   3  13
1   2  12
0   1  11

In [57]:
df.reset_index(drop=True, inplace = True)

In [58]:
df

    a   b
0  10  20
1   9  19
2   8  18
3   7  17
4   6  16
5   5  15
6   4  14
7   3  13
8   2  12
9   1  11

In [59]:
df.sort_values(by = ['a'])

    a   b
9   1  11
8   2  12
7   3  13
6   4  14
5   5  15
4   6  16
3   7  17
2   8  18
1   9  19
0  10  20

### 결측값 처리

In [60]:
df = pd.DataFrame({'a': [1,1,3,4,5], 'b' : [2,3,np.NAN,3,4]})

In [61]:
df

   a    b
0  1  2.0
1  1  3.0
2  3  NaN
3  4  3.0
4  5  4.0

In [62]:
df.isnull()

       a      b
0  False  False
1  False  False
2  False   True
3  False  False
4  False  False

In [63]:
df.isnull().sum()

a    0
b    1
dtype: int64

In [64]:
df.dropna()

   a    b
0  1  2.0
1  1  3.0
3  4  3.0
4  5  4.0

In [65]:
df.dropna(axis=1)

   a
0  1
1  1
2  3
3  4
4  5

In [70]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, np.NAN], 'b' : [2, 3, np.NAN, np.NAN, 4]})

In [71]:
df

     a    b
0  1.0  2.0
1  1.0  3.0
2  3.0  NaN
3  4.0  NaN
4  NaN  4.0

In [72]:
df.fillna(method='bfill')

     a    b
0  1.0  2.0
1  1.0  3.0
2  3.0  4.0
3  4.0  4.0
4  NaN  4.0

In [74]:
df.fillna(method='ffill', limit=1)

     a    b
0  1.0  2.0
1  1.0  3.0
2  3.0  3.0
3  4.0  NaN
4  4.0  4.0

In [76]:
df.mean()['a']

2.25

### 타입 변환

In [77]:
df = pd.DataFrame({'판매일' : ['5/11/21', '5/12/21'],
                   '판매량' : ['10', '15']})

In [78]:
df.dtypes

판매일    object
판매량    object
dtype: object

In [80]:
df = df.astype({'판매량' : 'int'})
# df['방문자수'] = pd.to_numeric(df['방문자수'], errors = 'coerce')

In [81]:
df.dtypes

판매일    object
판매량     int32
dtype: object

In [82]:
df['판매일'] = pd.to_datetime(df['판매일'], format="%m/%d/%y")

In [84]:
df.dtypes

판매일    datetime64[ns]
판매량             int32
dtype: object

### 레코드, 칼럼 추가/삭제

In [85]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})

In [86]:
df['d'] = [1, 3, 6, 4, 8]

In [87]:
df

   a  b  c  d
0  1  2  3  1
1  1  3  4  3
2  3  2  7  6
3  4  3  6  4
4  5  4  4  8

In [88]:
df['e'] = 1

In [89]:
df

   a  b  c  d  e
0  1  2  3  1  1
1  1  3  4  3  1
2  3  2  7  6  1
3  4  3  6  4  1
4  5  4  4  8  1

In [91]:
df.dtypes

a    int64
b    int64
c    int64
d    int64
e    int64
dtype: object

In [92]:
df['f'] = df['a'] + df['b'] + df['c']

In [93]:
df

   a  b  c  d  e   f
0  1  2  3  1  1   6
1  1  3  4  3  1   8
2  3  2  7  6  1  12
3  4  3  6  4  1  13
4  5  4  4  8  1  13

In [94]:
df.drop(['d', 'e', 'f'], axis=1)

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4

In [95]:
df.append({'a' : 4, 'b' : 4, 'c' : 5}, ignore_index=True)

     a    b    c    d    e     f
0  1.0  2.0  3.0  1.0  1.0   6.0
1  1.0  3.0  4.0  3.0  1.0   8.0
2  3.0  2.0  7.0  6.0  1.0  12.0
3  4.0  3.0  6.0  4.0  1.0  13.0
4  5.0  4.0  4.0  8.0  1.0  13.0
5  4.0  4.0  5.0  NaN  NaN   NaN

In [97]:
df.loc[6] = [1, 2, 3, 4, 5, 6]

In [98]:
df.drop(0)

   a  b  c  d  e   f
1  1  3  4  3  1   8
2  3  2  7  6  1  12
3  4  3  6  4  1  13
4  5  4  4  8  1  13
6  1  2  3  4  5   6

In [99]:
df

   a  b  c  d  e   f
0  1  2  3  1  1   6
1  1  3  4  3  1   8
2  3  2  7  6  1  12
3  4  3  6  4  1  13
4  5  4  4  8  1  13
6  1  2  3  4  5   6

In [100]:
df.drop([i for i in range(1,3)])

   a  b  c  d  e   f
0  1  2  3  1  1   6
3  4  3  6  4  1  13
4  5  4  4  8  1  13
6  1  2  3  4  5   6

In [101]:
df.drop(df.index[:4])

   a  b  c  d  e   f
4  5  4  4  8  1  13
6  1  2  3  4  5   6

In [102]:
df.drop(df[df['a']<4].index)

   a  b  c  d  e   f
3  4  3  6  4  1  13
4  5  4  4  8  1  13

### apply, map을 활용한 데이터 변환

In [103]:
df = pd.DataFrame({'a' : [1, 2, 3, 4, 5]})

In [104]:
df['b'] = 0

In [105]:
a = df[df['a'] < 2]

In [106]:
a

   a  b
0  1  0

In [107]:
df['b'][a.index] = '2 미만'

In [108]:
df

   a     b
0  1  2 미만
1  2     0
2  3     0
3  4     0
4  5     0

In [109]:
def case_function(x):
  if x < 2:
    return '2 미만'
  elif x < 4:
    return '4 미만'
  else:
    return '4 이상'

In [110]:
df['c'] = df['a'].apply(case_function)

In [111]:
df

   a     b     c
0  1  2 미만  2 미만
1  2     0  4 미만
2  3     0  4 미만
3  4     0  4 이상
4  5     0  4 이상

In [112]:
a = { 1: 'one' , 2 : 'two', 3: 'three', 4: 'four', 5: 'five'}

In [113]:
df['e'] = df['a'].map(a)

In [114]:
df

   a     b     c      e
0  1  2 미만  2 미만    one
1  2     0  4 미만    two
2  3     0  4 미만  three
3  4     0  4 이상   four
4  5     0  4 이상   five

### 데이터 프레임 결합

In [116]:
df1 = pd.DataFrame({'a' : [1, 2, 3]})
df2 = pd.DataFrame({'a' : [2, 3, 4]})

In [117]:
pd.concat([df1, df2])

   a
0  1
1  2
2  3
0  2
1  3
2  4

In [118]:
pd.concat([df1, df2], ignore_index=True)

   a
0  1
1  2
2  3
3  2
4  3
5  4

In [120]:
# pd.merge(df1, df2, how="left, rigth, inner, outer", on="변수명")
# pd.merge(df1, df2, how = 'outer', left_on= '', right_on = '')

### 그룹화

In [121]:
df1 = pd.DataFrame({'ID' : [1, 2, 3, 4, 5], '가입일' : ['2021-01-02', '2021-01-04', '2021-01-10', '2021-02-10', '2021-02-21'], '성별' : ['F', 'M', 'F', 'M', 'M']})
df2 = pd.DataFrame({'구매순서' : [1, 2, 3, 4, 5], 'ID' : [1, 1, 2, 4, 1], '구매일' : [1, 1, 2, 2, 3], '금액' : [1000, 1500, 2000, 3000, 4000]})

In [122]:
pd.merge(df1, df2, how='left', on = 'ID')

   ID         가입일 성별  구매순서  구매일      금액
0   1  2021-01-02  F   1.0  1.0  1000.0
1   1  2021-01-02  F   2.0  1.0  1500.0
2   1  2021-01-02  F   5.0  3.0  4000.0
3   2  2021-01-04  M   3.0  2.0  2000.0
4   3  2021-01-10  F   NaN  NaN     NaN
5   4  2021-02-10  M   4.0  2.0  3000.0
6   5  2021-02-21  M   NaN  NaN     NaN

In [123]:
df2

   구매순서  ID  구매일    금액
0     1   1    1  1000
1     2   1    1  1500
2     3   2    2  2000
3     4   4    2  3000
4     5   1    3  4000

In [124]:
df2.groupby(by = ['ID'])['금액'].sum()

ID
1    6500
2    2000
4    3000
Name: 금액, dtype: int64

In [125]:
s2 = df2.groupby(by = ['ID'])['금액'].sum()

In [126]:
pd.merge(df1, s2, how = 'left', on = 'ID')

   ID         가입일 성별      금액
0   1  2021-01-02  F  6500.0
1   2  2021-01-04  M  2000.0
2   3  2021-01-10  F     NaN
3   4  2021-02-10  M  3000.0
4   5  2021-02-21  M     NaN

In [129]:
df2.groupby(by = ['ID', '구매일'])['금액'].sum()

ID  구매일
1   1      2500
    3      4000
2   2      2000
4   2      3000
Name: 금액, dtype: int64

In [130]:
s2 = df2.groupby(by = ['ID', '구매일'])['금액'].sum()

In [131]:
pd.merge(df1, s2, how = 'left', on = 'ID')

   ID         가입일 성별      금액
0   1  2021-01-02  F  2500.0
1   1  2021-01-02  F  4000.0
2   2  2021-01-04  M  2000.0
3   3  2021-01-10  F     NaN
4   4  2021-02-10  M  3000.0
5   5  2021-02-21  M     NaN

In [132]:
df3 = pd.DataFrame(s2)

In [133]:
df3

          금액
ID 구매일
1  1    2500
   3    4000
2  2    2000
4  2    3000

In [134]:
df2.groupby(by = ['ID', '구매일'], as_index=False)['금액'].sum()

   ID  구매일    금액
0   1    1  2500
1   1    3  4000
2   2    2  2000
3   4    2  3000

In [135]:
df3 = df2.groupby(by = ['ID', '구매일'], as_index=False)['금액'].sum()

In [136]:
pd.merge(df1, df3, how = 'left', on = 'ID')

   ID         가입일 성별  구매일      금액
0   1  2021-01-02  F  1.0  2500.0
1   1  2021-01-02  F  3.0  4000.0
2   2  2021-01-04  M  2.0  2000.0
3   3  2021-01-10  F  NaN     NaN
4   4  2021-02-10  M  2.0  3000.0
5   5  2021-02-21  M  NaN     NaN

In [138]:
# df.groupby(by = ['ID'])['금액'].agg([sum, len])
# df2.reset_index(inplace=True)

### 피벗 테이블

In [139]:
df = pd.DataFrame({'가입월': [1, 1, 1, 2, 2, 3], '탈퇴월' : [1, 2, 3, 2, 3, 3], '탈퇴회원수' : [101, 52, 30, 120, 60, 130]})

In [142]:
pivot = pd.pivot_table(df, values= '탈퇴회원수', index = ['가입월'], columns = ['탈퇴월'], fill_value = 0)

In [143]:
pivot

탈퇴월    1    2    3
가입월
1    101   52   30
2      0  120   60
3      0    0  130

In [144]:
import random

In [145]:
a = []
b = []
for i in range(100):
  a.append(random.randint(1,3))
  b.append(random.randint(1,3))

In [146]:
df

   가입월  탈퇴월  탈퇴회원수
0    1    1    101
1    1    2     52
2    1    3     30
3    2    2    120
4    2    3     60
5    3    3    130

In [147]:
df = pd.DataFrame({'품목' : a, '크기' : b})

In [148]:
df

    품목  크기
0    3   1
1    1   3
2    3   2
3    1   1
4    2   1
..  ..  ..
95   3   3
96   1   3
97   3   2
98   1   2
99   2   1

[100 rows x 2 columns]

In [152]:
df['금액'] = df['품목'] * df['크기'] * 500
df['수수료'] = df['금액'] * 0.1

In [153]:
df

    품목  크기    금액    수수료
0    3   1  1500  150.0
1    1   3  1500  150.0
2    3   2  3000  300.0
3    1   1   500   50.0
4    2   1  1000  100.0
..  ..  ..   ...    ...
95   3   3  4500  450.0
96   1   3  1500  150.0
97   3   2  3000  300.0
98   1   2  1000  100.0
99   2   1  1000  100.0

[100 rows x 4 columns]

In [155]:
pd.pivot_table(df, values = '금액', index = ['품목'], columns = ['크기'], aggfunc = {'count', 'sum'})

   count            sum
크기     1   2   3      1      2      3
품목
1      8  14  16   4000  14000  24000
2     13   7  14  13000  14000  42000
3      9   8  11  13500  24000  49500